In [1]:
%load_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:password@localhost/

In [2]:
%%sql
show databases;

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('student_performance_at_open_university',),
 ('sys',)]

In [7]:
%%sql

# CREATE DATABASE test;
# drop database test;

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [19]:
%%sql

# create database study;
use study;

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [20]:
%%sql

select * from study;

 * mysql+pymysql://root:***@localhost/
(pymysql.err.ProgrammingError) (1146, "Table 'study.study' doesn't exist")
[SQL: select * from study;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [22]:
%%sql

create table study (sno int, name varchar(30));

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [41]:
%%sql
select * from study;

 * mysql+pymysql://root:***@localhost/
(pymysql.err.ProgrammingError) (1146, "Table 'study.study' doesn't exist")
[SQL: select * from study;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [24]:
%%sql

insert into study(sno, name) values(1,"ragu")

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[]

In [27]:
%%sql

insert into study values(2,"ram")

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[]

In [29]:
%%sql
update study set name="rajesh" where sno = 2;

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[]

In [33]:
%%sql
# update study set name="ram",sno=100 where sno = 2;
update study set name = 'ram',sno=2 where sno=100

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[]

In [42]:
%%sql

# delete from study.study where sno=2;

# truncate table study;

# drop table study;

drop database study;

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [47]:
%%sql

# create database test;
use test;
create table employees (
    employees_id int primary key,
    first_name varchar(30) not null,
    last_name varchar(30) not null,
    hire_date date not null,
    salary decimal(10,2)
);

 * mysql+pymysql://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [48]:
%%sql

select * from test.employees;

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [ ]:
#CTAS
# CREATE TABLE AS


CREATE TABLE high_paid_employees AS 
SELECT
    employee_id,
    first_name,
    last_name,
    salary
FROM employees
WHERE salary > 60000;

In [49]:
# Dropes after the scession completed. 
# We will run within querry after getting result.
# it will removes

#TEMP TABLE CREATION
CREATE TEMPORARY TABLE temp_high_paid_employees (
    employee_id INT,
    salary DECIMAL(10,2)
);
INSERT INTO temp_high_paid_employees
SELECT
    employees_id,
    salary
FROM employees
WHERE salary > 60000;

SyntaxError: invalid syntax (1912164056.py, line 3)

In [ ]:
# CTE COMMON TABLE EXPRESSION
Temp table and not saving datadase

WITH high_paid_employees_cte AS(
    SELECT employees_id, first_name, last_name, salary
    FROM employees
    WHERE salary > 70000
);
CREATE TABLE high_salary_employees_via_cte
SELECT * FROM high_salary_cte;